{
  "news": [
    {
      "title": "Nuvola 4.22 adds Airsonic and opens survey",
      "link": "https://medium.com/nuvola-news/nuvola-4-22-released-7b4e232c2711",
      "date": "May 9th, 2021",
      "text": "Version 4.22 introduces new services Anghami, updates Deezer, iHeartRADIO and Spotify, and opens Nuvola Player Survey."
    },
    {
      "title": "Nuvola 4.21 brings Anghami, adds official support for  Linux Mint, Cinnamon and Mate",
      "link": "https://medium.com/nuvola-news/nuvola-4-21-released-e8e7ca00aa95",
      "date": "April 11th, 2021",
      "text": "It also updates Spotify, Tidal, Amazon Cloud Player, Audible, Primephonic, and Qobuz."
    },
    {
      "title": "Nuvola 4.20 brings Audible and Emby, prepares for feature requests voting",
      "link": "https://medium.com/nuvola-news/nuvola-4-20-released-43e119bb1e94",
      "date": "December 28th, 2020",
      "text": "Another monthly release of Nuvola Player is out in the wild. Version 4.20 introduces two new services Audible and Emby, fixes integration of Bandcamp, drops Tiliado accounts and begins preparation for feature requests voting."
    },
    {
      "title": "Nuvola 4.19 brings iHeartRADIO, Pretzel and three updated services",
      "link": "https://medium.com/nuvola-news/nuvola-4-19-released-b4b1266f89a5",
      "date": "November 29th, 2020",
      "text": "Nuvola 4.19 was released. It brings two new services - iHeartRADIO and Pretzel and updates three services - Amazon Cloud Player, Spotfy and YouTube Music."
    },
    {
      "title": "Nuvola 4.18 brings Apple Music and Gaana, resumes Qobuz support, and more",
      "link": "https://medium.com/nuvola-news/nuvola-4-18-released-5bb1512ec90d",
      "date": "October 30th, 2020",
      "text": "Nuvola 4.18 was released. It brings two new services (Apple Music and Gaana, an updated Qobuz script adopted by Romain Berger, and lots of improvements under the hood."
    },
    {
      "title": "Nuvola 4.17 brings MusicBrainz scrobbling, Idagio, DI.FM, Primephonic, and more",
      "link": "https://medium.com/nuvola-news/nuvola-4-17-released-80852f885e90",
      "date": "September 28th, 2020",
      "text": "Nuvola 4.17 was released. It brings MusicBrainz scrobbling and three new services: Idagio, DI.FM and Primephonic. Most of the features and bug fixes have already been released to users of Nuvola flatpak builds for a long time but they haven't been officially announced until now."
    },
    {
      "title": "Nuvola 4.16 Brings Libre.FM Scrobbling, Ivoox Service, and more",
      "link": "https://medium.com/nuvola-news/nuvola-4-16-86a089068784",
      "date": "February 24th, 2019",
      "text": "Nuvola 4.16 was released. It reintroduces Libre.fm scrobbling, adds new service Ivoox, comes with updated Adwaita GTK theme and brings other bug fixes and improvements."
    },
    {
      "title": "Nuvola 4.15 Released",
      "link": "https://medium.com/nuvola-news/nuvola-4-15-released-ccf2e02e6d4e",
      "date": "December 28th, 2018",
      "text": "Nuvola 4.15 was released. It brings the 28th streaming service (Jamendo), officially supports OpenSUSE, uses client-side window decorations by default (can be changed), fixes a few memory leaks and continues the quest to improve the quality of the entire codebase."
    },
    {
      "title": "Nuvola 4.14 Released",
      "link": "https://medium.com/nuvola-news/nuvola-4-14-released-533f1677ab5b",
      "date": "November 11th, 2018",
      "text": "Nuvola 4.14 was released. It brings two new services (Tidal and MentorFM), a few user-visible changes, upgrades the library stack (Chromium and GNOME Platform) and continues the quest to improve the quality of the entire codebase."
    },
    {
      "title": "Nuvola 4.13 Released",
      "link": "https://medium.com/nuvola-news/nuvola-4-13-released-2fdf80c73742",
      "date": "October 14th, 2018",
      "text": "Nuvola 4.13 was released. This announcement summarizes user-visible changes, which have been already announced separately, as well as important news for script maintainers and third-party packagers."
    },
    {
      "title": "Nuvola Integrates Repeat & Shuffle Status, Adjusts to New Deezer Design, And More",
      "link": "https://medium.com/nuvola-news/nuvola-integrates-repeat-shuffle-status-adjusts-to-new-deezer-design-and-more-397d3bc1e03a",
      "date": "September 24th, 2018",
      "text": "The latest flatpak builds of Nuvola Apps integrate shuffle/repeat states, fix compatibility with the new Deezer design, and introduce Flash plugin updater for Amazon Cloud Player. In addition, the free tier bar was removed from the main window, the purchase flow was simplified, and the pricing has changed offering lifetime licenses as a one-time payment."

    },
    {
      "title": "Nuvola Comes With Start-Up Tips, New Documentation, and More",
      "link": "https://medium.com/nuvola-news/nuvola-comes-with-start-up-tips-new-documentation-and-more-597326be591b",
      "date": "August 24th, 2018",
      "text": "The latest flatpak builds of Nuvola Apps show useful tips during the start-up, add help buttons to individual features for faster access to new documentation written from scratch, and allow you to start writing a bug report with just two clicks. We added new issue templates on Github to make easier to report bugs, suggest features or just ask questions."

    },
    {
      "title": "Nuvola Apps Runtime Fixes Issue with Spotify & Widevine Plugin, Tweaks Dark Theme Option and Scrollbars",
      "link": "https://medium.com/nuvola-news/nuvola-apps-runtime-fixes-issue-with-spotify-widevine-plugin-tweaks-dark-theme-option-and-dbd22ebdce04",
      "date": "August 8th, 2018",
      "text": "The latest flatpak builds of Nuvola Apps fix the incompatibility of a new Widevine plugin (needed by Spotify), enable a dark theme preference for nine web apps that use a rather dark user interface, and improve the appearance of Chromium scrollbars (both light and dark variants are available). Individual Nuvola apps now check whether the installed Nuvola Apps Service does have the same version to prevent compatibility issues."
    },
    {
      "title": "Nuvola 4.12 Released",
      "link": "https://medium.com/nuvola-news/nuvola-4-12-released-297cb17630c1",
      "date": "July 21st, 2018",
      "text": "Nuvola 4.12 was released. This announcement is targeted to script maintainers and third-party packagers rather than to users because all user-visible changes have already been announced before."
    },
    {
      "title": "Nuvola Brings Redesigned Preferences Dialog, More Appearance Settings, and Bug Fixes",
      "link": "https://medium.com/nuvola-news/nuvola-brings-redesigned-preferences-dialog-more-appearance-settings-and-bug-fixes-6545325b35f3",
      "date": "July 14th, 2018",
      "text": "The latest flatpak builds of Nuvola Apps bring redesigned Preferences dialog with expanded Appearance section as well as a few bug fixes."
    },
    {
      "title": "Nuvola Adds YouTube Music, Updates Jango & Tune In, Drops Logitech Media Server",
      "date": "June 30th, 2018",
      "link": "https://medium.com/nuvola-news/nuvola-adds-youtube-music-updates-jango-tune-in-drops-logitech-media-server-37dfc73bc6f9",
      "text": "A new script was added to the stable Flatpak repository: YouTube Music. Jango & Tune In integrations got a new maintainer, were ported to the Chromium-based backend for audio playback without Flash plugin and updated to the latest Nuvola standards. Logitech Media Server script is now unsupported until a new maintainer is found."
    },
    {
      "title": "Nuvola Adds Qobuz, Updates KEXP Radio and Yandex Music",
      "date": "June 17th, 2018",
      "link": "https://medium.com/nuvola-news/nuvola-adds-qobuz-updates-kexp-radio-and-yandex-music-a67c9ee8d783",
      "text": "A new script was added to the stable Flatpak repository: Qobuz. KEXP Radio got a new maintainer and was adjusted to new player interface. Yandex Music was ported to Chromium-based backend for audio playback without Flash plugin. Finally, Nuvola Runtime received a few tweaks."
    },
    {
      "title": "Nuvola Adds Pandora Radio, Updates Sound Cloud & Sirius XM",
      "date": "June 3rd, 2018",
      "link": "https://medium.com/nuvola-news/nuvola-adds-pandora-radio-updates-sound-cloud-sirius-xm-1691822ef1fe",
      "text": "A new script was added to the stable Flatpak repository: Pandora Radio. Sound Cloud got a new maintainer and was significantly improved. Sirius XM was adjusted to recent changes in its web interface."
    },
    {
      "title": "Nuvola Adds Three New Scripts: Brain.fm, Focus@Will, and NPR One",
      "date": "May 20th, 2018",
      "link": "https://medium.com/nuvola-news/nuvola-adds-three-new-scripts-brain-fm-focus-will-and-npr-one-ca989ad0530a",
      "text": "Three new scripts were added to the stable Flatpak repository: Brain.fm, Focus@Will, and NPR One."
    },
    {
      "title": "Nuvola 4.11.0 Released",
      "link": "https://medium.com/nuvola-news/nuvola-4-11-0-released-1aecb90a2fb9",
      "date": "May 8th, 2018",
      "text": "Nuvola 4.11.0 was released. It is mostly meaningless for users of the genuine flatpak builds of Nuvola (they receive improvements, bug fixes and new features continuously), but packagers of third-party builds may find it helpful to get a fixed release that summarizes recent changes."
    },
    {
      "title": "Nuvola Updates Amazon Cloud Player, BBC iPlayer & Jupiter Broadcasting; Supports Fedora 28",
      "date": "May 6th, 2018",
      "link": "https://medium.com/nuvola-news/nuvola-updates-amazon-cloud-player-bbc-iplayer-jupiter-broadcasting-supports-fedora-28-38c809a08639",
      "text": "The latest stable Flatpaks of Amazon Cloud Player, BBC iPlayer & Jupiter Broadcasting — all maintained by Andrew Stubbs — were updated to use Chromium-based backend for music playback without Flash plugin whenever possible. Installation instructions were updated for Fedora 28, and Nuvola Runtime received a few tweaks."
    }
  ]
}
